Revit 2017 API
StructuralSectionZProfileWithLips.BottomFlangeLength Property
 Bottom Flange segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public double BottomFlangeLength { get; set; }
Visual Basic
Public Property BottomFlangeLength As Double
	Get
	Set
Visual C++
public:
property double BottomFlangeLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionZProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace